Revit 2026 API

# AssemblyInstanceSetTransform Method

---

Sets the origin of the assembly instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetTransform(
	Transform trf
)
```
```vb
Public Sub SetTransform (
	trf As Transform
)
```
```cpp
public:
void SetTransform(
	Transform^ trf
)
```
```fsharp
member SetTransform :
        trf : Transform -> unit
```

#### Parameters

trf Transform
     Transform to be set.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentsInconsistentException | trf is not a rigid body transformation. |

#### Reference

AssemblyInstance Class

Autodesk.Revit.DB Namespace